# ЗАДАЧА №3

# В некоторой школе решили набрать три новых математических класса и оборудовать кабинеты для
# них новыми партами. За каждой партой может сидеть два учащихся. Известно количество учащихся в
# каждом из трех классов. Выведите наименьшее число парт, которое нужно приобрести для них.

# Input: 20 21 22 (ввод чисел НЕ в одну строку)
# Output: 32

class1 = int(input("Введите количество учащихся в 1-м классе: "))
class2 = int(input("Введите количество учащихся в 2-м классе: "))
class3 = int(input("Введите количество учащихся в 3-м классе: "))

sum = class1 + class2 + class3
result = sum // 2

if sum % 2 != 0:
    result += 1

print(result)